Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །དོན་ཡོད་པའི་ཞགས་པ་ཆེན་པོའི་དཀྱིལ་འཁོར་གྱི་རིག་སྔགས་འཆང་གི་ཆོ་ག་གསང་བའོ།། །།
en: This concludes the secret procedure of the vidyā holders, the great amogha maṇḍala.

source: དོན་ཡོད་པའི་སྒྱུ་མ་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱ་བའི་སྒྲུབ་པའི་ཆོ་ག་ནི།
en: This practice comprises various procedures of magically producing illusory amogha displays. “

source: དེ་ནས་དེའི་འོག་ཏུ་ཕྱག་རྒྱ་བྲི་བའི་དཀྱིལ་འཁོར་བཤད་པར་བྱ་སྟེ།
en: Now I will teach a maṇḍala in which various mudrās are drawn.

source: རྟགས་མཚོན་ཕྱག་རྒྱའི་དེ་ཉིད་ནི། །པདྨ་རྒྱས་དང་སྣ་ཚོགས་མཚོན། །པདྨ་ཁ་ནི་ཕྱེད་བྱེ་བ། །ཕྱག་དག་ན་ནི་རབ་ཏུ་འཛིན།
en: The mudrās are emblems, true mudrā seals; they are various implements that are held in two hands emerging from a blooming lotus.

source: །ཕྱག་གཉིས་ཕྱུང་ཞིང་བརྐྱང་ནས་ཀྱང་། །བསྐུམ་པའམ་འཛིན་སྟངས་དེ་ཉིད་ཀྱིས། །ཀུན་ནས་ཕྲེང་བ་འབར་བའི་རྟགས། །མཚོན་ཆ་ཕྱག་རྒྱ་བསྣམས་པ་ནི། །འདི་ལྟ་སྟེ། རལ་གྲི་དང་།
en: The lotuses should be drawn half open, each with a pair of hands emerging from it, either outstretched or contracted into fists, and should be encircled with a garland of flames.

source: མདུང་ཐུང་དང་། མདའ་བོ་ཆེ་དང་། མདུང་རྩེ་གསུམ་པ་དང་། ཡིད་བཞིན་གྱི་ནོར་བུ་དང་། རྒྱལ་མཚན་དང་། རྡོ་རྗེ་དང་། རྡོ་རྗེ་ཕྲེང་ཟླུམ་དང་། ལས་ཀྱི་རྡོ་རྗེ་དང་། ཟུར་གསུམ་མ་ཞེས་བྱ་བ་དང་། འཁོར་ལོ་དང་། དུང་དང་། ཐོ་བ་དང་། ཞགས་པ་དང་། དགྲ་སྟ་དང་། དབྱུག་ཐོ་དང་།
en: The hands hold the emblems and implements and display the mudrā gestures.

source: མེ་ཏོག་གི་ཐུམ་པོ་དང་། བུམ་པ་གང་བ་དང་། རིན་པོ་ཆེའི་སྣོད་དང་། པདྨའི་ཕྲེང་བ་དང་། རྡོ་རྗེའི་ཕྲེང་ཟླུམ་དང་།
en: The implements are a sword, spear, javelin, trident, wish-fulfilling jewel, banner, vajra scepter, vajra disk, double vajra, triangle, wheel, conch, hammer, noose, axe, and mace, a basket with flowers, a full jar, jeweled vessel, garland of lotuses, circle of vajra scepters, garland of blue lotuses, and garland of flowers, a pink lotus, blue lotus, and moon disk, Mount Sumeru, a mirror, nāga, and sacred thread, the moon, the sun, a banner, a parasol, a forehead, the staff of Yama, the mouth of a crocodile, a string of beads, a circle of tridents, the threatening gesture, a frown, the gesture of giving comfort, the gesture of granting fearlessness, the gesture of granting boons, the añjali gesture, a book stand, mendicant’s staff, alms bowl, parasol, diadem, string of jewels, golden string, string of pearls, bracelet, and armlet, earrings, and a stack of wood for the fire pit. “

source: ཨུཏྤ་ལའི་ཕྲེང་བ་དང་། མེ་ཏོག་གི་ཕྲེང་བ་དང་། པདྨ་དང་། ཨུཏྤ་ལ་དང་། ཟླ་བ་དང་། རི་རབ་དང་། མེ་ལོང་དང་། ཀླུ་དང་། མཆོད་ཕྱིར་ཐོགས་དང་། ཟླ་བ་དང་། ཉི་མའི་རྒྱལ་མཚན་དང་། གདུགས་དང་། བེ་ཅོན་དང་། གཤིན་རྗེའི་བེ་ཅོན་དང་། ཆུ་སྲིན་གྱི་ཁ་དང་། སྔགས་དེའི་ཕྲེང་བ་དང་།
en: These mudrā emblems are placed in the hands that emerge from the lotuses.

source: མདུང་རྩེ་གསུམ་པའི་ཕྲེང་ཟླུམ་དང་། བསྡིགས་པ་དང་། བསྒྱིངས་པ་དང་། དབུགས་འབྱིན་པ་དང་། མི་འཇིགས་པ་དང་། མཆོག་སྦྱིན་པ་དང་། ཐལ་མོ་སྦྱར་བ་དང་། གླེགས་བམ་བསྣམས་པ་དང་། འཁར་གསིལ་དང་། ལྷུང་བཟེད་དང་། གདུགས་དང་། དབུ་རྒྱན་དང་། ནོར་བུ་བརྒྱུས་པ་དང་། གསེར་སྐུད་དང་། མུ་ཏིག་གི་ཕྲེང་བ་དང་། གདུ་བུ་དང་། དཔུང་རྒྱན་དང་། རྣ་ཆ་དང་། མེའི་ཐབ་ཁུང་ངོ་། །ཀུན་ནས་འབར་ཕྲེང་ཕྱག་རྒྱ་དེ། །སྣ་ཚོགས་རྨད་དུ་བྱུང་བས་སྨྲས། །མཚོན་ཆ་སྣ་ཚོགས་བསྣམས་པ་ཡི། །པདྨ་འཛིན་ལ་རབ་ཏུ་གནས།
en: The hands thus hold various implements and are surrounded by a garland of flames and various other marvels.

source: །རས་ལ་བྲིས་པའམ་དཀྱིལ་འཁོར་རམ། །རྩིག་པའམ་གང་ཡང་རུང་བ་ལ། །ཚོན་རྩི་རྣམ་པ་སྣ་ཚོགས་ཀྱིས།
en: They should be drawn either on a cotton cloth, a maṇḍala, a wall, or any other appropriate material, and they should be brightly painted in various colors.

source: །གང་དུ་བྲིས་པ་མཐོང་བ་དེ། །ངན་འགྲོ་སེམས་ཅན་དམྱལ་བར་ནི། །ཕྱིར་ཡང་འགྲོ་བར་མི་འགྱུར་རོ།
en: Those who see them will not be born in hell again, nor will they fall into lower realms.

source: །འཇིག་རྟེན་དབང་གིས་རྟག་མཆོག་སྦྱིན། །སྡིག་པ་ཐམས་ཅད་རྣམ་པར་སྤངས།
en: They will always receive boons from Noble Avalokiteśvara and will be freed from all their wrongdoings.

source: །གང་ཞིག་ཉེས་བྱས་མི་ཟད་པ། །མཚམས་མེད་ལྔ་པོ་བྱེད་པ་ཉིད། །མནར་མེད་པ་ཡི་གནས་དང་ནི། །དམྱལ་བ་གཞན་དུ་གཞོལ་བ་གང་། །ཕྱག་རྒྱ་དེ་དག་མཐོང་ཙམ་གྱིས།
en: Even if they have committed terrible evil, such as the five acts of immediate retribution, and are destined to be reborn in the Avīci hell or other hells, all their negativities will be purified upon seeing the mudrā symbols.

source: །འགྲོ་བ་ཐམས་ཅད་ཟད་པར་འགྱུར། །སྐྱེ་དང་འཆི་ལས་རྣམ་པར་གྲོལ། །འཁོར་བའི་རྒྱ་མཚོ་བརྒལ་བར་འགྱུར།
en: Freed from old age and death, these beings will cross the ocean of saṃsāra.

source: །དེ་དག་སྐྱེ་བ་ཕྱི་མར་ནི། །ཕྱིར་ཡང་མངལ་གྱིས་མི་གོས་ཏེ།
en: Their current birth will be their last; never again will they be soiled by birth from a womb.

source: །ཡང་དང་ཡང་དུ་པདྨ་ལས། །རྫུས་ཏེ་སྐྱེ་བ་དག་ཏུ་འགྱུར། །རྟག་ཏུ་བདེ་བ་ཅན་དུ་འགྲོ། །གང་ན་འདྲེན་པ་ཚེ་དཔག་མེད། །བཞུགས་པའི་སྤྱན་སྔར་རྟག་ཏུ་དེར།
en: They will be spontaneously born from a lotus flower, again and again, in the realm of Sukhāvatī, and will always visit places where the Guide is present.

source: །སྐྱེ་འགྱུར་ཐེ་ཙོམ་མི་ཟ་ཞིང་། །དོན་རྣམས་བདེ་བར་འགྲུབ་འགྱུར་ཞིང་།
en: They will certainly be born in the presence of Amitāyus; there is no doubt about this. “

source: །རིག་སྔགས་སྣ་ཚོགས་བདེ་བར་འགྲུབ། །བདེ་བར་དཀྱིལ་འཁོར་འགྲུབ་འགྱུར་ཞིང་།
en: They will swiftly accomplish all their various tasks, the vidyā, and the maṇḍala.

source: །རྟག་ཏུ་མི་ལྡོགས་གནས་འགྱུར།
en: They will attain the level of not turning back.

source: །ཕྱག་རྒྱ་འདི་དག་མཐོང་ཙམ་གྱིས། །སངས་རྒྱས་བྱང་ཆུབ་དང་མཉམ་འགྱུར།
en: Through merely beholding these mudrā symbols, they will attain realization equal to that of the Buddha.

source: །དུས་གསུམ་གཤེགས་པའི་སངས་རྒྱས་ལ། །བླ་མེད་དགེ་རྩ་བསྐྱེད་པར་འགྱུར། །འཇིག་རྟེན་འདི་དང་ཕ་རོལ་ཏུ། །བསོད་ནམས་ཕུང་པོ་ཆེན་པོ་འཐོབ།
en: They will plant the roots of supreme virtue equal to the buddhas of the three times, and they will accumulate a great amount of merit in both this life and the next. “

source: །དེ་ནས་དཀྱིལ་འཁོར་རབ་བཤད་པ། །དེ་ཉིད་འགྲུབ་པའི་ཕྱག་རྒྱ་རྣམས། །འཇིག་རྟེན་འདི་དང་ཕ་རོལ་ཏུ། །འདོད་པ་ཐམས་ཅད་རབ་ཏུ་སྦྱིན། །སྡིག་པ་ཐམས་ཅད་མོད་ལ་སེལ།
en: Now I will teach about a maṇḍala of mudrā emblems that produces genuine accomplishments, unfailingly fulfills all wishes in this world and the next, and instantly removes all evil.

source: །གང་ཞིག་མཚམས་མེད་བྱེད་པ་དག །མི་བཟད་མནར་མེད་གནས་པ་ཡི། །སྡིག་པ་ཐམས་ཅད་འཇིག་པར་འགྱུར།
en: The terrible sins of those who have committed the five acts of immediate retribution and are now suffering torment in the Avīci hell will be completely eradicated.

source: །དམྱལ་བའི་སྒོ་རྣམས་བཅད་ནས་ནི། །མཐོ་རིས་སྒོ་ཕྱེ་ཐེ་ཚོམ་མེད། །སྒོ་ཕྱེ་གྱུར་པ་རྣམས་ལ་ནི།
en: The doors to the hell realms will be closed and the doors to the heavens open; there is no doubt about this.

source: །སངས་རྒྱས་ཞིང་རྣམས་སྣང་བར་འགྱུར། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དགོངས་པ།
en: They will be able to see all the buddha fields, and all the tathāgatas there will care for them.

source: མགོན་པོ་འཇིག་རྟེན་དབང་ཕྱུག་གི་ཕྱག་རྒྱའི་དཀྱིལ་འཁོར་མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: As soon as they behold the lokeśvara Lord in the maṇḍala of mudrā symbols, they will attain the level of not turning back.

source: །ཕྱག་རྒྱའི་དཀྱིལ་འཁོར་འདི་མཐོང་ན་ཤི་འཕོས་པའི་མོད་ལ་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: Beings who die after seeing the maṇḍala with its mudrā symbols will go to the realm of Sukhāvatī after they die.

source: །དཀྱིལ་འཁོར་འདི་ཞུགས་པ་ཙམ་གྱིས་གང་ན་ཐུབ་པ་འདྲེན་པ་འོད་དཔག་མེད་བཞུགས་པའི་ཕོ་བྲང་དུ་མྱུར་དུ་འཇུག་པར་འགྱུར་རོ།
en: By merely entering this maṇḍala, they will swiftly proceed to the abode of Amitābha, home of the Guide and Sage. “

source: །དཀྱིལ་འཁོར་གྲུ་བཞི་ལྷམ་པ་ལ། །ཀུན་ནས་ཆ་ནས་མཛེས་པར་བྱ། །གྲུ་བཞི་གོ་ལའི་ཚད་ཙམ་ལ།
en: The maṇḍala should be rectangular, and every part of it should be beautiful.

source: །སྒོ་བཞི་ཐེམ་སྐས་བཞི་ཡིས་བརྒྱན། །ཤིན་ཏུ་ལེགས་པར་བསྐུས་དང་ལྡན།
en: Its four sides and corners should be well measured and adorned with four doors, each with a flight of stairs.

source: །འཇམ་ཞིང་མཉེན་ལ་མཉམ་པ་ཡི། །ས་ཡི་ཆ་དང་ལྡན་པ་ལ།
en: The place on the ground should be swept clean and prepared well so that it has a soft surface as smooth as silk.

source: །དཀྱིལ་འཁོར་ཤེས་རབ་ཅན་གྱིས་དབྱེ། །དཀྱིལ་འཁོར་དེ་ཉིད་ཐིག་བཏབ་ལ།
en: The skilled vidyā holder should measure out its symmetrical shape with a measuring cord as required for a true maṇḍala.

source: །ཕྱག་རྒྱ་བྲི་བ་རྣམ་པར་དབྱེ། །ཕྱོགས་བཞིའི་ཆ་ནི་མཉམ་པ་ཡི།
en: Having divided it into parts, he should draw the mudrā symbols grouped equally in the four directions.

source: །དབུས་ན་དཀྱིལ་འཁོར་སྙིང་པོ་ཡིན། །གྲུ་བཞི་པ་ལ་ཀུན་ནས་ཁ་ཁྱེར་གྱི་རྣམ་པ་དང་། མདུང་རྩེ་གསུམ་པའི་ཕྲེང་བ་རྣམ་པར་དབྱེའོ།
en: Within the maṇḍala he should delimit a square area surrounded by a veranda and a row of tridents.

source: །གྲུ་བཞི་པའི་དབུས་སུ་ཕྱག་རྒྱ་དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱ་ཀུན་ནས་འབར་བ་བླ་ན་མེད་པ་དང་།
en: In the center of the square area he should draw a hand that displays the mudrā of Amoghapāśa and is surrounded by a halo of exquisite light.

source: ཕྱག་རྒྱ་རྒྱན་གྱིས་བརྒྱན་པ་ཚོན་རྩི་སྣ་ཚོགས་ཀྱིས་བྲིའོ།
en: The hand should be adorned with ornaments that are drawn with various paints in vivid colors. “

source: །དབུས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཕྱི་རོལ་གྱི་གནས་སུ་ཕྱག་རྒྱ་བྲི་བ་ཡང་ཤིན་ཏུ་འབྱེས་པར་བྱའོ།
en: The vidyā holder should carefully distribute the mudrā emblems outside the central area, spacing them at regular intervals.

source: །དཀྱིལ་འཁོར་ཀུན་ནས་གོས་དང་། བ་དན་དང་། རྒྱལ་མཚན་གྱིས་བརྒྱན་ལ་ཀུན་དུ་ཡུངས་ཀར་དཀར་པོ་གཏོར་རོ།
en: He should adorn the entire maṇḍala with streamers, flags, and banners and sprinkle it with black mustard seeds.

source: །ཕྱག་རྒྱའི་དཀྱིལ་འཁོར་ཀྱི་ཕྱི་རོལ་གྱི་གནས་སུ་ཕྱོགས་བཞི་ཀུན་དུ་བྱ་བ་ནི་བ་ལང་གི་ལྕི་བས་དང་བསྲེས་པ་ཤིན་ཏུ་ལེགས་པར་བྱུགས་པ་དང་ལྡན་པ་ལ་ཚོན་རྩིའི་ཕྱེ་མས་ཁ་ཁྱེར་གྱི་རྣམ་པ་དང་།
en: The four quarters of the outer zone of the maṇḍala that contains the mudrās should be covered in clay and cow dung. It should be swept clean, well prepared, and brightly colored with powdered dyes.

source: ཀུན་ནས་པདྨའི་ཕྲེང་བ་རྒྱ་ཆེན་པོ་དང་། མཚོན་ཆ་བྲིས་ལ་འདིའི་སྒོ་བཞི་ཡང་རྣམ་པར་དབྱེས་པར་བྲིའོ།
en: The skilled vidyā holder should surround this zone with a veranda and a row of lotuses, draw the mudrā implements there, and demarcate the four doors. “

source: །ཇི་ལྟར་ཕྱག་རྒྱ་དང་མཐུན་པའི་རོ་སྣ་ཚོགས་ཀྱི་གཏོར་མ་གཞག་པར་བྱ་སྟེ། ཕྱག་རྒྱ་རེ་རེ་ལ་ཡང་མཆོད་ཡོན་ཕུལ་ལ། དབྱིབ་མོ་དང་། ཕྲུ་བ་དང་།
en: He should then offer a bali of ‘white’ food of various flavors that accord with each of the mudrā implements, adding an offering of argha water for the feet.

source: བུམ་པ་དང་། ཁམ་ཕོར་དང་། རྫེའུ་གཏོར་མས་བཀང་ལ་གཞག་གོ། །ཀུན་དུ་བུམ་པ་གང་བ་དང་། །བདུག་སྤོས་ཀྱི་ནི་སྣོད་དག་དང་།
en: He should fill pots, jars, pitchers, cups, and water jars with the bali articles and place full jars and incense holders all around it.

source: །མེ་ཏོག་འབྲས་བུ་སྣ་ཚོགས་དང་། །གཏོར་མ་དཀར་པོ་དག་གིས་བཀང་། །མེ་ཏོག་རྣམ་པར་བཀྲམ་བྱས་ལ། །ཀུན་དུ་ཕྲེང་བས་གཞག་པར་བྱ། །ཕྲེང་བ་བཟང་པོ་བཞག་ནས་ཀྱང་། །དེ་བཞིན་ཀུན་དུ་བདུག་སྤོས་དབུལ། །ཨ་ག་རུ་དང་།
en: He should supplement the white bali with various flowers and fruits, strew the maṇḍala with flowers, and surround it with garlands.

source: ཙནྡན་དང་། དུ་རུ་སྐ་དང་། ས་ལ་ཀི་དང་སྤྲྀ་ཀ་དང་། གུ་གུལ་དང་། སྲ་རྩི་པོག་དང་།
en: After arranging divine garlands, he should offer incense of agarwood, sandalwood, olibanum, sallakī, fenugreek, bdellium, sarjarasa, nameru, musk, and camphor.

source: སྒྲོན་ཤིང་དང་།
en: They should be arranged around the maṇḍala and lit. “

source: གླ་རྩི་དང་། ག་བུར་གྱི་བདུག་པ་འདི་དག་གིས་བདུགས་ལ། གཏོར་མ་དང་། མེ་ཏོག་དང་།
en: Having thus offered a bali of food and flowers, he should enter the mudrā maṇḍala.

source: ལྷ་བཤོས་དབུལ་ལོ། །ཕྱག་རྒྱའི་དཀྱིལ་འཁོར་དུ་འཇུག་པས་དོན་ཡོད་པའི་རྒྱལ་པོ་དྲན་པར་བྱས་ཏེ་བསྐོར་ལ་ཕྱག་རྒྱའི་དཀྱིལ་འཁོར་ལ་ཕྱག་བྱ་ཞིང་ཕྱག་རྒྱ་ཐམས་ཅད་ལ་མེ་ཏོག་བཀྲམ་ཞིང་མེ་ཏོག་གཏོར་རོ།
en: Mindfully reciting the Amogharāja mantra, he should circumambulate the maṇḍala clockwise, bow to all the mudrās, and cast a flower.

source: །གང་ཕྱག་རྒྱའི་དེ་ཁོ་ན་ཉིད་གསང་བ་འདི་དང་།
en: The mudrā upon which the flower falls is the mudrā of the secret essence. This mudrā will make the maṇḍala effective for obtaining whatever result it is employed for. “

source: ཕྱག་རྒྱའི་དཀྱིལ་འཁོར་འདི་སྒྲུབ་པ་གང་དགོས་པ་ལ་སྔར་དཀྱིལ་འཁོར་ཕྱག་རྒྱ་དང་བཅས་པ་ལ་མཆོག་ཏུ་མཛེས་པར་བྱས་ལ། ཕྱིས་ལས་ཐམས་ཅད་བྱའོ། །རིག་སྔགས་འཆང་བ་གཙང་མ་ཡིས།
en: First, the vidyā holder should prepare the mudrā maṇḍala, making it exquisitely beautiful, and afterward perform all the rites.

source: །གཙང་མ་ཡི་ནི་གོས་བགོས་ལ། །ཇི་ལྟར་དཀྱིལ་འཁོར་ཆོ་ག་བཞིན། །དཀྱིལ་འཁོར་དུ་ནི་གཞུག་པར་བྱ། །ཇི་ལྟར་དཀྱིལ་འཁོར་ལ་དགོས་པ། །དེ་བཞིན་དུ་ནི་ལས་བྱའོ།
en: He should purify himself ritually, put on clean clothes, and cause beings to enter the maṇḍala as required by the maṇḍala procedure.

source: །ཕྱག་རྒྱའི་དཀྱིལ་འཁོར་བླ་མེད་པ། །དཀྱིལ་འཁོར་འདིར་ནི་ཞུགས་ཙམ་གྱིས། །ཐུབ་པ་སྣང་མཛད་ཀྱིས་གསུངས་པའི།
en: The activities that he accomplishes depend on the maṇḍala rites he performs, and they will be accomplished as soon as he enters the mudrā maṇḍala, a maṇḍala that is supreme.

source: །སྤྱི་ཡི་རིགས་ནི་ཐམས་ཅད་དུ། །ཕྱག་རྒྱ་དཀྲིགས་དང་གཏམས་རྣམས་ཀྱིས། །དམ་ཚིག་ཀུན་དུ་ཤེས་པར་འགྱུར། །སྤྱི་རིགས་ཀུན་གྱི་ཆོ་ག་ཡི། །དམ་ཚིག་རྗེས་ཞུགས་དེ་བཞིན་ནོ།
en: He will come to know the samayas for all the mudrās, numbering millions of billions, that are shared by all the buddha families and were taught by the sage Vairocana, and likewise he will enter the samaya of all the rites shared by these families. “

source: །དཀྱིལ་འཁོར་ཀུན་ཏུ་ཞུགས་པ་དང་། །རྒྱལ་བས་ལུང་ནི་བསྟན་པར་འགྱུར།
en: Those who enter the mudrā maṇḍala will have their future awakening prophesied by all the victors.

source: །ཀུན་གཟིགས་དེ་བཞིན་གཤེགས་པ་ཡི། །ཕྱག་ནི་སྤྱི་བོར་འཇོག་པར་མཛད། །ཆོས་ཀྱི་རོ་ནི་བདུད་རྩི་ཡི། །གཟི་བརྗིད་མོད་ལ་འཇུག་པར་འགྱུར།
en: All the tathāgatas will watch over them, place their hands on their heads, infuse them with ambrosia-like Dharma essence, charge them with vital energy, and instantly bestow upon them the amogha accomplishments that are taught in the maṇḍala of Vairocana.

source: །རྣམ་སྣང་མཛད་གསུངས་དཀྱིལ་འཁོར་དུ། །དོན་ཡོད་དངོས་གྲུབ་སྩོལ་བར་མཛད། །ཕྱག་རྒྱའི་དཀྱིལ་འཁོར་གང་བཞུགས་པ། །ཀུན་དུ་སྤྱི་ཡི་རིགས་རྣམས་ཀྱི། །དོན་ཡོད་དངོས་གྲུབ་མཆོག་མྱུར་ཐོབ།
en: Those who enter the mudrā maṇḍala will swiftly obtain the supreme amogha accomplishment that is shared by all buddha families.

source: །སངས་རྒྱས་བྱེ་བ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུའི་དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་འགྱུར་རོ། །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་ཏེ།
en: They will obtain the roots of virtue from hundreds of thousands of millions of billions of tathāgatas, equal in number to the grains of sand in ninety-nine Gaṅgā rivers, and they will accumulate a great amount of merit.

source: ཡོན་ཏན་གྱི་ཕན་ཡོན་འདི་དག་ནི་ཚེ་འདི་ཡིན་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་པདྨ་ལས་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ།
en: They can expect special desirable qualities in this world, and later they will proceed to the realm of Sukhāvatī, where they will be spontaneously born from a lotus flower with the ability to remember their consecutive births.

source: །ཚེ་རབས་སུ་ཚེ་རབས་དྲན་ཞིང་འོད་ཟེར་བྱེ་བ་འབར་བའི་ལུས་དང་ལྡན་ཞིང་། །ཚེ་བསྐལ་པ་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པར་འགྱུར་རོ།
en: Their bodies will blaze with millions of light rays, and their lifespan will be hundreds of thousands of immeasurable eons. “

source: །ཡོན་ཏན་ཐམས་ཅད་དྲི་མ་མེད་པར་སྣང་བ་དོན་ཡོད་པའི་རྣམ་པར་འཕྲུལ་པ་བསྟན་པ་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་འཐོབ་སྟེ།
en: They will obtain the samādhi called the magical amogha display of the pure light of all the qualities.

source: །གང་ཏིང་ངེ་འཛིན་ཐོབ་པས་སྒྱུ་མ་ཆེན་པོ་ལྟ་བུའི་རྣམ་པར་འཕྲུལ་པའི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་སྟོན་པར་བྱེད་དོ།
en: By obtaining this samādhi they will manifest the magical ability to work miracles that are like great illusory displays.

source: །དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱི་ལྷའི་སྤྱིའི་རིགས་དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱིས་བྱིན་གྱིས་བརླབས་ཀྱི་རྗེས་སུ་འཇུག་པར་འགྱུར་རོ། །ལྷ་དང་། ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་།
en: They will convey the blessings of all the maṇḍala deities and of the lineage wherein all tathāgata families are equal.

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་ཐམས་ཅད་དབང་དུ་གྱུར་ནས་རྟག་ཏུ་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ།
en: All devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas—all nonhuman and human beings—will fall under their thrall and become their followers.

source: །སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་དཀྱིལ་འཁོར་རྣམས་འབྱོར་པར་གཟིགས་ནས་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་སྦ་བ་མཛད་པར་འགྱུར་རོ།
en: All buddhas and bodhisattvas and all maṇḍala deities will appear to them and stand by in order to guard, protect, and defend them.

source: །སེམས་ཅན་ཐམས་ཅད་ཕྱི་བཞིན་འབྲང་ཞིང་མཆོད་པ་ཆེན་པོ་བྱེད་པར་འགྱུར་རོ།
en: All beings will regard them as worthy of their worship and become their followers.

source: །རྒྱལ་པོ་བཙུན་མོ་དང་། འཁོར་དང་བཅས་པ་རྣམས་ཀྱིས་མཆོད་པའི་འོས་ཆེན་པོར་འགྱུར་རོ།
en: They will become deserving objects of worship and receive generous offerings from kings with their harems and retinues.

source: །སེམས་ཅན་ཐམས་ཅད་གཅིག་ཏུ་བླ་མར་བྱེད་པར་འགྱུར་རོ། །ནད་ཐམས་ཅད་མེད་པར་འགྱུར་རོ། །སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: They will become the sole teacher of everyone, all their diseases will disappear, and all their obscurations will be purified. “

source: །མཚན་མ་བྲི་བའི་ཕྱག་རྒྱའི་དཀྱིལ་འཁོར་གྱི་ཆོ་གའོ།། །།
en: This concludes the procedure of the mudrā maṇḍala wherein symbols are drawn. “

source: དེ་ནས་སྦྱིན་སྲེག་གི་ཆོ་གའི་དཀྱིལ་འཁོར་བཤད་པར་བྱ་སྟེ། རིག་སྔགས་འཆང་བ་རྣམ་དག་གི། །འདི་ཉིད་སྒྲུབ་པ་བསྒྲུབ་པའི་ཕྱིར།
en: Now I will teach, for the sake of vidyā holders, a maṇḍala for the homa procedure.

source: །སྤྱི་ཡི་རིགས་རྣམས་ཐམས་ཅད་ཀྱི། །ཆོ་ག་ཞིབ་མོ་བླ་མེད་ཡིན།
en: This genuine sādhana, a supreme rite for realizing the sameness of all the families, is for their success.

source: །གང་གིས་སྦྱིན་སྲེག་བྱས་ཙམ་གྱིས། །ཕྱོགས་ཀུན་རྣམ་པར་གཟིགས་པ་ཡི། །དེ་བཞིན་གཤེགས་གནས་བྱོན་འགྱུར་ཞིང་།
en: As soon as this homa is offered, all the tathāgatas will arrive from every direction and watch over the vidyā holder.

source: །བྱང་ཆུབ་སེམས་དཔའ་དགོངས་པར་འགྱུར།
en: Bodhisattvas will care for him too.

source: །རིག་སྔགས་དངོས་གྲུབ་རྗེས་སྩོལ་ཅིང་། །རྟག་ཏུ་སྲུང་བ་མཛད་པར་འགྱུར། །མགོན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས།
en: They will grant him the accomplishment of the vidyā and will always protect him.

source: །ཐེ་ཙོམ་མེད་པར་མྱུར་དུ་བྱོན། །མགོན་པོ་འཁོར་བཅས་གནས་ཉིད་ན། །རང་གི་གཟུགས་སུ་མཐོང་བར་འགྱུར།
en: There is no doubt that Noble Lord Avalokiteśvara will swiftly arrive and appear before him in person with all his retinue.

source: །འདོད་པ་ཐམས་ཅད་རྟག་ཏུ་སྩོལ། །རྟག་ཏུ་མཆོག་ནི་སྩོལ་བ་ཉིད། །ཉིན་དང་མཚན་དུ་རྟག་པར་ནི།
en: They will always fulfill vidyā holder’s every wish, grant him boons, and watch over him at all times, day and night.

source: །རྣམ་པར་གཟིགས་འགྱུར་ཐེ་ཙོམ་མེད།
en: There is no doubt about this. “

source: །དཀྱིལ་འཁོར་བཤད་པར་བྱ་བ་སྟེ།
en: Now I will describe the maṇḍala.

source: །དཀྱིལ་འཁོར་གྲུ་བཞི་ཤིན་ཏུ་མཛེས་པར་བྱ་བ་ནི་རྒྱ་ཆེན་པོ་ཀོ་ལའི་ཚད་ཙམ་ལ།
en: The vidyā holder should carefully measure out a large maṇḍala with four sides.

source: ལེགས་པར་བྱུགས་པ་ཤིན་ཏུ་འཇམ་པ།
en: Its surface should be wiped clean and made soft.

source: ཤིན་ཏུ་གསལ་བ་གྲུ་བཞི་སྒོ་བཞི་དང་། ཐེམ་སྐས་བཞི་དང་ལྡན་པ།
en: It should be symmetrical, with four corners, four doors, and flights of stairs in a regular pattern.

source: རྣམ་པར་དབྱེས་པ་མཆོག་ཏུ་མཛེས་པ་དབུས་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྙིང་པོར་ཡང་བྱའོ།
en: It should be executed to perfection.

source: །མེ་ཡི་གནས་ཀྱི་དཀྱིལ་འཁོར་ནི།
en: In the central area he should delimit the maṇḍala where the fire will be.

source: །གྲུ་བཞི་ཉིད་ཀྱི་རྣམ་པ་ལ། །ཀུན་ནས་ཐེམ་སྐས་བཞི་དག་དང་། །སྟེང་དུ་གྲྭ་ནི་བཞི་པ་བྱ།
en: It should be square in shape, with four sides and four flights of stairs around it.

source: །རྟག་ཏུ་པདྨའི་སྙིང་པོ་དང་།
en: At the center he should draw a square with a mandatory lotus inside it.

source: སྙིང་པོ་རྒྱས་པའི་སྟེང་དུ་ཡང་། །ཀུན་ནས་འདབ་མ་མཛེས་པར་བྱ།
en: The lotus should be fully blooming, with a pericarp and a beautiful ring of petals.

source: །གྲྭ་བཞིར་པདྨའི་ཕྲེང་བ་བྱ། །དེ་བཞིན་དུ་གྲྭ་གཉིས་ཀར་རྡོ་རྗེ་པདྨ་དང་བཅས་པའོ། །གསུམ་པར་མདུང་རྩེ་གསུམ་པ་པདྨ་དང་བཅས་པའོ། །བཞི་པར་འཁོར་ལོ་པདྨ་དང་བཅས་པའོ།
en: In the first corner, he should draw a fine garland of lotuses; in the second corner, a vajra scepter and a lotus; in the third, a lotus and a trident; and in the fourth, a lotus and a wheel.

source: །ལྔ་པར་བུམ་པ་གང་བ་གཞག་གོ།
en: In the fifth area, he should place a full jar. “

source: །སྣ་ཚོགས་ཚོན་གྱིས་རྣམ་མཛེས་པའི། །ཀུན་ནས་འདབ་མའི་མྱུ་གུ་བྱ། །རིན་ཆེན་སྣོད་ནི་བཀང་བ་དང་། །མེ་ཏོག་ཕྲེང་དང་ངང་བ་དང་།
en: He should paint the sections of the maṇḍala in various distinct colors, draw leaves and sprouts all around it, and fill it with flower garlands and jeweled vessels.

source: །ཕྱེ་མ་པདྨར་བཅས་པ་དང་། དེ་བཞིན་མེ་ཏོག་རིགས་དག་ཉིད། །དེ་བཞིན་སྣ་ཚོགས་བརྒྱན་པའོ།
en: He should draw enclosures for swans with lotuses and different species of flowers, as well as a variety of ornaments and adornments.

source: །ནུབ་ཀྱི་གནས་དང་གྲྭ་དག་ཏུ། །པདྨའི་འདབ་མ་ཨུཏྤལ་བཅས། །བུམ་པ་དཱུར་བས་བཀང་བ་བྲི། །རྩ་བའི་བུམ་པ་དབུ་མ་ལ། །འདིར་ནི་ཁ་ཁྱེར་ཐིག་ཀྱང་གདབ།
en: In the corners on the western side, he should draw a white lotus and a blue lotus and full jars on the bed of dūrvā grass.

source: །དེ་ནས་དཀྱིལ་འཁོར་མཛེས་བྱ་བ། །ཐིག་གིས་ཀུན་ནས་ཆ་མཉམ་ཞིང་།
en: Around the center of the maṇḍala he should trace out the veranda with a railing of spears. “

source: །སྒོ་བཞི་མཛེས་པར་བྱ་བ་ནི།
en: He should then use a measuring cord to delimit the surrounding areas, demarcating the four doors.

source: །ཚོན་སྣ་ལྔ་ཡི་སྐུད་པས་གདབ།
en: He should surround the maṇḍala with five threads and paint a ring of flames all around it.

source: །མེ་འབར་མདོག་ཅན་བྲི་བ་ནི། །ཀུན་ནས་འབར་བའི་ཕྲེང་བ་ཅན། །གྲྭ་དང་གྲྭར་ནི་མེ་ལྷ་བྲི།
en: In each corner he should draw the fire deity in the color of blazing fire.

source: །ལུས་ནི་མེ་མདོག་འབར་བ་དང་། །ལག་ན་མེ་འབར་འཛིན་པ་དང་།
en: His body is blazing fire, and he holds a blazing flame in his hand.

source: །མཚན་མ་སྣ་ཚོགས་གཞན་དག་ཀྱང་། །ཆོ་ག་བཞིན་དུ་བྲི་བར་བྱ།
en: The vidyā holder should also draw various other symbols as required by the procedure.

source: །དཀྱིལ་འཁོར་གྱི་ནི་ཆོ་ག་བཞིན། །བ་དན་མདའ་དང་སྣ་ལྔ་ཡི། །སྐུད་པས་བུམ་པ་གང་དཀྲིས་དང་། །དེ་བཞིན་བདུག་སྤོས་སྣོད་དག་གིས། །ཀུན་ནས་དཀྱིལ་འཁོར་བརྒྱན་པར་བྱ།
en: The maṇḍala should be fully decorated with arrows, banners, and threads in five colors according to the maṇḍala requirements. “

source: །སྣ་ཚོགས་གཟུགས་ཅན་རྒྱ་ཆེ་ཡི། །སྣ་ཚོགས་རོ་ཡི་གཏོར་མ་གཞག །རྫེའུ་དང་ཁམ་ཕོར་རྣམ་གསུམ་གྱི། །དཀར་པོས་དཀར་བ་གཞག་པར་བྱ།
en: The skilled vidyā holder should arrange full jars, incense holders, and bali articles of various flavors and forms, including the three ‘white’ foods.

source: །རྫེའུ་དང་དབྱིབ་མོ་བུམ་པ་ནི། །གཏོར་མས་བཀང་བ་ཀུན་དུ་གཞག །
en: All around the maṇḍala he should place water bowls, cups, jars, pitchers, and pots, each filled with the bali articles.

source: འབྲས་བུ་རྣམ་པ་སྣ་ཚོགས་གཞག །ཀུན་ནས་མེ་ཏོག་དགྲམ་བྱ་ཞིང་།
en: He should add various fruits and strew the maṇḍala with flowers.

source: །ཕྲེང་བ་སྣ་ཚོགས་གཞག་པར་བྱ། །འབྲས་ཡོས་ཡུངས་ཀར་གཏོར་ནས་ནི།
en: He should add various garlands and sprinkle the maṇḍala with grains of parched rice and mustard seeds.

source: །ཀུན་དུ་མར་མེ་འབར་བ་དག །སྣ་ཚོགས་དྲི་དང་དེ་བཞིན་དུ། །དྲི་ཡི་ཕྱེ་མ་ལྷ་བཤོས་དང་། །དཀྱིལ་འཁོར་ཀུན་ལ་གཞག་པར་བྱ།
en: He should surround the maṇḍala with lighted lamps, including those that exude various scents, and place fragrant powders and the offerings of food everywhere.

source: །དཀྱིལ་འཁོར་དག་ནི་ཐམས་ཅད་ལ། །བླུགས་གཟར་དཱུར་བ་རྟག་ཏུ་གཞག །
en: He should include a pair of sacrificial ladles and always place dūrvā grass all around the entire maṇḍala. “

source: ཤིང་ནི་ཨརྐ་ཤི་མི་དང་། །ཡུངས་ཀར་འབྲས་ནི་སོ་བ་དང་། །ཞུན་མར་དང་ནི་མར་དཀར་དང་། །ཀུན་དུ་ཙནྡན་དཀར་པོ་དག །
en: He should use sticks of giant milkweed or śamī tree for fuel, and the homa articles should include mustard seeds and rice grains mixed with ghee, freshly churned butter, olibanum, and white sandalwood.
